UB_Copy/src/InformationRegisters/УБ_ЗначенияШкалыПоказателей/УБ_ЗначенияШкалыПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБ_ЗначенияШкалыПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>УстановкаЗначенийШкалыПоказателей</name>
    <type>
      <types>DocumentRef.УБ_УстановкаЗначенийШкалыПоказателей</types>
    </type>
  </resources>
  <dimensions>
    <name>ШкалаПоказателей</name>
    <type>
      <types>CatalogRef.УБ_ШкалыПоказателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UB_Copy/src/InformationRegisters/УБ_ЗначенияШкалыПоказателей/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ШкалаПоказателя) Тогда
		УстановитьОтборСписка(ЭтотОбъект, Параметры.ШкалаПоказателя);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСписка(Форма, ШкалаПоказателя)
	
	Список = Форма.Список; 			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ШкалаПоказателей", ШкалаПоказателя);

КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
		
	Если Список.Отбор.Элементы.Количество() > 0 Тогда 
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("ШкалаПоказателей", Список.Отбор.Элементы[0].ПравоеЗначение);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	КонецЕсли;
	
	ОткрытьФорму("Документ.УБ_УстановкаЗначенийШкалыПоказателей.Форма.ФормаДокумента", ПараметрыФормы, ЭтотОбъект,,,, );
	

КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	СписокАктуальныхШкал = СформироватьСписокАктуальныхШкал();
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Список.УстановкаЗначенийШкалыПоказателей");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ОтборЭлемента.ПравоеЗначение = СписокАктуальныхШкал;
	
	ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Список");
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СкрытыйВариантОтчетаЦвет);
	
КонецПроцедуры

&НаСервере
Функция СформироватьСписокАктуальныхШкал()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УБ_ЗначенияШкалыПоказателейСрезПоследних.ШкалаПоказателей КАК ШкалаПоказателей,
	               |	УБ_ЗначенияШкалыПоказателейСрезПоследних.УстановкаЗначенийШкалыПоказателей КАК УстановкаЗначенийШкалыПоказателей
	               |ИЗ
	               |	РегистрСведений.УБ_ЗначенияШкалыПоказателей.СрезПоследних КАК УБ_ЗначенияШкалыПоказателейСрезПоследних";
	Результат = Запрос.Выполнить().Выгрузить();
	МассивАктуальныхШкал = Новый Массив;
	Для каждого Строка из Результат Цикл
		МассивАктуальныхШкал.Добавить(Строка.УстановкаЗначенийШкалыПоказателей);	
	КонецЦикла;
	
	Возврат МассивАктуальныхШкал;
	
КонецФункции
